package com.itheima.test5;

public class Test {
    static void main(String[] args) {
        Dog d1 = new Dog("burus", "white");
        d1.eat();
        d1.act();
        d1.drink();

        Cat c1 = new Cat("mimi", "orange");
        c1.eat();
        c1.act();
        c1.drink();
    }
}

/*
抽象类不能实例化
抽象类中不一定有抽象方法，有抽象方法的类一定是抽象类
抽象类中可以有构造方法
    构造方法的作用: 创建对象? 错误
    真正创建对象是用new关键字来实现的
抽象类的子类
    要么重写抽象类中的❗❗所有❗❗抽象方法❗❗❗❗❗
    要么子类也是抽象类

还有要提的是，有时候如果一个抽象类中方法过多，但是直接继承抽象类的子类需要重写所有的抽象方法，这样是很冗余的
为了解决这个问题,我们可以定义一个中间层adapter类,由它来空重写所有抽象类的方法
然后让子类继承这个中间类，这样就不用重写所有方法了，想重写哪个就重写哪个就行了！
中间层也是没有实例化意义的，所以也可以将其设置为抽象类
 */