package com.itheima.test2;

public class Test {
    static void main(String[] args) {
        Fu f = new Zi(); //创建一个类型是Fu的Zi子类对象❗❗❗❗❗
        f.fuShow();
        f.show();

//        f.ziShow();
        //f不能调用ziShow
        //如何让父类也可以调用子类的方法呢?

        //解决多态的弊端:向下转型，把父类对象转回子类类型就可以了
        /*
        有点类似于python的动态类型转换
         */
//        在进行强制类型转换的时候,只能转到自己的子类对象,不能转成其他子类对象
        Zi z = (Zi)f;
        z.ziShow();
    }
}

/*
多态的弊端:不能使用子类特有功能
引用数据类型转换，有集中方式?
自动类型转换(向上转型,把小的变成大的)


强制类型转换能解决什么问题？强制类型转换需要注意什么
可以转换成真正的子类类型，从而调用子类独有功能
转换类型与真实对象类型不一致会报错
 */